{
  "Hello, I'm Kuan-Cheng Tsai": "你好，我是蔡寬程",
  "I am a frontend developer specializing in mobile applications with React Native, with over four years of experience, and I also have experience using Next.js for web application development.": "我是一名專注於手機應用程式的前端開發人員，擁有 React Native 四年以上的開發經驗，並且也有使用 Next.js 進行 Web 應用程式開發的經驗。",
  "I have worked with companies such as": "我過去合作過的公司包括",
  "Work Projects": "工作專案",
  "Personal Projects": "個人專案",
  "Optimization loading speed": "優化加載速度",
  "Experience": "經歷",
  "Skills": "技能",
  "This is a music player app that allows users to listen to music.": "這是一個音樂播放器應用程式，允許使用者收聽音樂。",
  "This is a music player application that allows users to listen to music and store music lists locally, ensuring that music can be played without an internet connection. It also provides a filtering function, allowing users to filter music by artist, music category, music name, etc.\n\nDevelopment was motivated by the fact that most music players on the market do not have a filtering function, and unstable networks can cause music to be interrupted.\n\nThe project uses Expo for development, SQLite as a local database, Node.js as the backend, and Express.js to backup the database and music files.\n\nIn the future, it is expected to use Google Drive or other cloud storage services for backup to provide a better user experience.": "這是一個音樂播放器應用程式，允許使用者收聽音樂，並在本地儲存音樂列表，確保沒有網路連線時也能播放音樂。並提供過濾功能，可以按照歌手、音樂類別、音樂名稱等進行過濾。\n\n開發主因是想要解決市面上多數音樂播放器沒有過濾功能，以及網路不穩定導致音樂中斷等問題。\n\n該專案採用 Expo 進行開發，並透過 SQLite 作為本地資料庫，後端使用 Node.js，使用 Express.js 進行開發，負責備份資料庫和音樂檔案。\n\n預計未來會用 Google Drive 或其他雲端儲存服務進行備份，以提供更好的使用者體驗。",
  "This is a 2D face swap app that allows users to swap their face with another face.": "這是一個 2D 視頻臉部替換應用程式，允許使用者替換自己的臉部。",
  "This is a simple 2D face swap application, allowing users to replace their face with another person's face. Initially, the manager wanted to use existing streaming platforms to let users switch faces in real-time, but due to the performance of current mobile phones or personal computers, it was too difficult to achieve. Therefore, traditional mathematical formulas were used to implement the face swap logic. This project was developed using React Native and implemented the face swap logic using native modules Kotlin, Objective-C, C++, and OpenCV.": "這是一個簡單的 2D 視頻臉部替換應用程式，允許使用者替換自己的臉部。最初是主管想要透過現有的串流平台，讓使用者可以即時的切換臉部，但以當前手機或個人電腦的性能，實在是難以實現，因此採用傳統的數學公式來實現該功能。\n\n該專案透過 React Native 開發，並透過原生模組 Kotlin、Objective-C、C ++ 和 OpenCV 來實現人臉交換的邏輯。這是一個簡易的2D臉部替換應用程式，使用者可以替換自己的臉部為另一個人的臉部。最初是主管想要透過現有的串流平台，讓使用者可以即時的切換臉部，但以當前手機或個人電腦的性能，實在是難以實現，因此採用傳統的數學公式來實現該功能。\n\n該專案透過React Native開發，並透過原生模組 Kotlin、Objective-C、C ++ 和 OpenCV 來實現人臉交換的邏輯。",
  "This is a chat application with artificial intelligence.": "這是一個 AI 聊天應用程式。",
  "This is a simple chat application with artificial intelligence that was created for learning about AI, that allows users to create multiple chat rooms, and keeps memories of conversation. users can also delete conversation history.\n\nThis project was developed using Expo and GitHub models.": "這是一個簡單的 AI 聊天應用程式，它被創建用於學習 AI，允許使用者創建多個聊天室，並保存對話記憶。使用者也可以刪除對話歷史。該專案使用 Expo 和 GitHub 模型開發。",
  "Use React devtools and fliper find the performance issue and optimize it.": "使用 React devtools 和 Fliper 找出效能問題並優化。",
  "This was an optimization problem in a work project; the application was extremely slow during login.\n\nThere were two main causes:\n\nfirst, the state was reset twice during login, resulting in two API calls and all components being re-rendered;\n\nsecond, the Redux version was outdated, causing the `selectFromResult` property of `useQuery` to always be re-rendered.\n\nThese two issues were identified using two tools: React Devtools to check the number of re-renders and the Flipper plugin to check state changes.\n\nOnce the causes were found, the problem was essentially solved, and the fix not only resolved the issue but also improved the application's speed.": "這是工作項目中的最佳化問題，該應用程式在登入過程中速度非常慢。\n\n導致此問題的原因有兩個：\n\n首先，登入過程中狀態被重置了兩次，這導致 API 呼叫兩次，所有元件都被重新渲染；\n\n其次，Redux 版本過舊，導致設定 `selectFromResult` 的 useQuery 總是被重新渲染。\n\n關於找到這兩個問題則是透過兩項工具，其中一項是 React Devtools 用來檢查重新渲染的次數，另一項則是 Flipper 外掛程式來檢查狀態變化.\n\n找到原因後，問題也就相當於解決了，修正後，不僅解決問題本身，也提升了應用程式速度。"
}
